[
  {
    "chapter": "IAM and CLI",
    "section": [
      {
        "header": "Users and Policies",
        "notes": [
          ["Root User -> Admin User -> IAM User"],
          [
            "Users can gain policies by being added to groups or directly attached."
          ],
          [
            "IAM Policy",
            "Version - policy language version",
            "Id - policy identifier (optional)",
            "Statement - one or more individual statements"
          ],
          [
            "IAM Policy Statement",
            "Sid - statement identifier (optional)",
            "Effect - allow or deny",
            "Principal - account/user/role to which policy is applied",
            "Action - list of actions this policy allows or denies",
            "Resource - list of resources to which actions apply",
            "Condition - condition for when policy is in effect (optional)"
          ]
        ]
      },
      {
        "header": "CLI, Roles, Auditing",
        "notes": [
          [
            "AWS Access Types",
            "Management Console Access: password/MFA",
            "CLI: access key",
            "SDK (code): access key"
          ],
          ["AWS CloudShell: Alternate to CLI; Can upload and download files"],
          ["IAM Role: Assign policies to AWS services"],
          [
            "Auditing",
            "AWS Credential Report: See user credential logs",
            "AWS Access Advisor: See services access logs"
          ]
        ]
      }
    ]
  },
  {
    "chapter": "EC2: Elastic Compute Cloud/IaaS",
    "section": [
      {
        "header": "Basics",
        "notes": [
          ["Billing Dashboard to manage costs and create budgets"],
          [
            "EC2 Instance Attributes: OS, CPU, RAM, Storage, Network, Firewall, Bootstrap Script"
          ],
          [
            "EC2 User Data: Bootstrap script to run only once on instance launch",
            "Useful for installing updates, common files, etc.",
            "Runs with root user privileges"
          ],
          [
            "EC2 Instance Types: General Purpose, Compute Optimized, Memory Optimized, Storage Optimized"
          ],
          [
            "EC2 Security Groups: Firewall for EC2 instances",
            "Lives outside EC2 instance",
            "Many to many relationship with EC2 instances",
            "Default: all inbound blocked, all outbound Allowed",
            "Troubleshooting: Timeout -> Security error, Connection Refused -> Application error",
            "Notable Ports: 22 (SSH), 21 (FTP), 22 (SFTP), 80 (HTTP), 443 (HTTPS), 3389 (RDP)"
          ],
          ["SSH/EC2 Instance Connect: to be contd"]
        ]
      },
      {
        "header": "Associate",
        "notes": [
          [
            "Public vs Private IP (IPV4)",
            "IPV6: Newer, solves problems, but won't cover much here IE:2001:0000:130F:0000:0000:09C0:876A:130B",
            "IPV4: [0-255].[0-255].[0-255].[0-255]",
            "Public: Internet facing, unique to whole web, geo-locatable",
            "Private: Private network, unique within network, specified range of IPs, connects to internet via NAT + internet gateway (proxy)",
            "Elastic IP: Fixed IP for EC2 instance, used to mask failure, 5 per account, billed when not associated, avoid using",
            "Elastic IP alternatives: Public IP with registered DNS name, or Load Balancer"
          ],
          [
            "Placement Groups",
            "Cluster: Same rack, same AZ, low latency, high throughput, high risk. High Performance.",
            "Spread: Different racks, different AZ, limit 7 instances per AZ per placement group, low risk. High Availability.",
            "Partition: Many partitions (similar to racks), difference AZ, up to 7 partitions per AZ, up to 100s of EC2 instances. Mix Performance and Availability, like HDFS, HBase, Cassandra, Kafka, etc."
          ],
          [
            "Elastic Network Interfaces (ENI)",
            "Virtual network card, logical component in VPC",
            "Attributes: Primary private IPv4, secondary IPv4s, one Elastic IP per private IPv4, public IPv4, MAC address, security groups",
            "Can create ENI independently and attach to EC2 instance; bound to AZ, can be moved between EC2 instances",
            "Used for failovers"
          ],
          [
            "EC2 Hibernate",
            "Saves RAM to Root EBS volume (must be encrypted), faster boot time, 60 days max"
          ]
        ]
      }
    ]
  },
  {
    "chapter": "EC2 Storage",
    "section": [
      {
        "header": "EBS Volumes",
        "notes": [
          [
            "Elastic Block Store: 'network USB stick', good for failovers",
            "Bound to AZ, one instance at a time",
            "Can be snapshotted to move across AZs",
            "Need to provision capacity in advance, billed on provision",
            "Delete on Termination: EBS volume will delete itself when EC2 instance is terminated"
          ],
          [
            "EBS Snapshots",
            "Backup of EBS volume. Can copy across AZ or region. Recommended.",
            "EBS Snapshot Archive: 75% cheaper, longer restore time",
            "Recycle Bin: Stores deleted EBS snapshots for specified time for recovery.",
            "Fast Snapshot Restore (FSR): No latency, but costs extra. Helpful for large snapshots."
          ],
          [
            "Amazon Machine Image (AMI)",
            "Customization of EC2 instance. Add software, config, OS, monitoring, etc. Pre-packaged software for faster boot time.",
            "Region specific but can be copied across regions.",
            "AMI Types: Public, Private, Marketplace",
            "AMI Process: Start EC2 instance -> Customize -> Stop EC2 instance -> Build AMI (also creates EBS snapshots), launch instances from other AMIs"
          ],
          [
            "EC2 Instance Store",
            "Higher performance than EBS, but ephemeral storage. Good for buffer/cache/temporary content.",
            "Backup responsibly"
          ],
          [
            "EBS Volume Types",
            "1. gp2/gp3 (SSD): General purpose, balanced price and performance. 16000 IOPS.",
            "2. io1/io2 (SSD): Mission-critical purpose, highest performance. 64000 IOPS.",
            "3. st1 (HDD): Low cost, frequently accessed, throughput-intensive workloads. 500 IOPS, 500 MB/s throughput.",
            "4. sc1 (HDD): Lowest cost, less frequently accessed vs st1. 250 IOPS, 250 MB/s throughput.",
            "Only gp2/gp3 and io1/io2 can be used as boot volumes.",
            "io2 Block Express: Sub-millisecond latency, 256000 IOPS max, 1000 IOPS/GB",
            "https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ebs-volume-types.html"
          ],
          [
            "EBS Multi-Attach (io1/io2): Attach single EBS volume to up to 16 EC2 instances in same AZ. Achieve higher application availability in clustered Linux applications."
          ],
          [
            "EBS Encryption: Encrypts data at rest and in transit, snapshots, and volumes from snapshots. Always do.",
            "Encrypt an unencrypted volume: Create snapshot -> Copy snapshot and encrypt the copy -> Create volume from encrypted copy -> Attach volume to original EC2 instance"
          ]
        ]
      },
      {
        "header": "EFS",
        "notes": [
          [
            "Elastic File System: Managed NFS (Network File System)",
            "Multi-AZ, expensive, pay per use",
            "EFS-IA: Lifecycle policy",
            "One-Zone EFS: Single AZ, cheaper, less available"
          ]
        ]
      }
    ]
  },
  {
    "chapter": "Elastic Load Balancers",
    "section": [
      {
        "header": "Types",
        "notes": [
          [
            "4 Types:",
            "Classic Load Balancer: Deprecated",
            "Application Load Balancer: Layer 7, HTTP/HTTPS, WebSocket",
            "Network Load Balancer: Layer 4, TCP, UDP",
            "Gateway Load Balancer: Layer 3"
          ]
        ]
      },
      {
        "header": "Sticky Sessions",
        "notes": [
          [
            "Redirects user to the same instance behind a load balancer",
            "Uses Application-based cookies or Duration-based cookies, AWSALB etc."
          ]
        ]
      },
      {
        "header": "Sticky Sessions",
        "notes": [
          [
            "Redirects user to the same instance behind a load balancer"
          ]
        ]
      }
    ]
  },
  {
    "chapter": "Review",
    "section": [
      {
        "header": "EC2",
        "notes": [
          [
            "Spot Fleet: Request for EC2 instances at a lower price, can be interrupted, good for batch jobs, can be used with on-demand instances"
          ]
        ]
      }
    ]
  }
]
